## Plan Result (user-list-search-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/10855862861)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_role_policy.corpus_events_hydration_lambda_execution_policy
  * aws_iam_role_policy.corpus_events_lambda_execution_policy
  * aws_lambda_event_source_mapping.corpus_events_hydration_sqs
  * aws_lambda_event_source_mapping.corpus_events_sqs
* Replace
  * aws_ecs_task_definition.apollo



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.apollo must be replaced
+/- resource "aws_ecs_task_definition" "apollo" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:614" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - mountPoints            = []
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - cpu                    = 0
                  ~ environment            = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "CORPUS_INDEX_DE"
                            value = "corpus_de"
                        },
                      ~ {
                            name  = "CORPUS_INDEX_EN"
                          ~ value = "corpus_en" -> "corpus_en_luc"
                        },
                        {
                            name  = "CORPUS_INDEX_ES"
                            value = "corpus_es"
                        },
                        # (13 unchanged elements hidden)
                    ]
                  - mountPoints            = []
                    name                   = "node"
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserListSearch-Prod-Apollo" -> (known after apply)
      ~ revision                 = 614 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userlistsearch"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserListSearch"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_role_policy.corpus_events_hydration_lambda_execution_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "corpus_events_hydration_lambda_execution_policy" {
        id          = "UserListSearch-Prod-CorpusParserHydratorLambdaExecutionRole:UserListSearch-Prod-CorpusParserHydratorAccessPolicy"
        name        = "UserListSearch-Prod-CorpusParserHydratorAccessPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage*",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage*",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:996905175585:UserListSearch-Prod-CorpusParserHydrator"
                    },
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_es/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_en/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_en_luc/_bulk",
                            "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_de/_bulk",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "sagemaker:InvokeEndpointAsync",
                            "sagemaker:InvokeEndpoint",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sagemaker:us-east-1:996905175585:endpoint/CorpusEmbeddings-Prod-ep-mltvhddp"
                    },
                    # (3 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.corpus_events_lambda_execution_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "corpus_events_lambda_execution_policy" {
        id          = "UserListSearch-Prod-CorpusEventsLambdaExecutionRole:UserListSearch-Prod-CorpusEventsAccessPolicy"
        name        = "UserListSearch-Prod-CorpusEventsAccessPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage*",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage*",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:996905175585:UserListSearch-Prod-CorpusEvents"
                    },
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_es/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_en/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_en_luc/_bulk",
                            "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_de/_bulk",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "ssm:GetParameter*"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/*",
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod",
                        ]
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.corpus_events_hydration_sqs will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "corpus_events_hydration_sqs" {
      ~ enabled                            = false -> true
        id                                 = "cde1badb-84d9-4f63-801c-640acecda26f"
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_event_source_mapping.corpus_events_sqs will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "corpus_events_sqs" {
      ~ enabled                            = false -> true
        id                                 = "68cfb2d0-6eec-4788-84a1-326561ee8e11"
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:614" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":736,"Program":"tfcmt","SHA1":"eec592115f9ca029d24f7062ba0e3ecf42b41f6c","Target":"user-list-search-production","Vars":{},"WorkflowName":"User List Search"} -->